Trade.Partner_debt/src/InformationRegisters/PartnerDebt_РучныеЛимитыДолгаПартнера/PartnerDebt_РучныеЛимитыДолгаПартнера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>PartnerDebt_РучныеЛимитыДолгаПартнера</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Trade.Partner_debt/src/AccumulationRegisters/РасчетыСКлиентами/РасчетыСКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="2ac23005-c54f-421a-add8-7227d22cdeea">
  <name>РасчетыСКлиентами</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="c9e8d76f-ff62-4b53-8393-d4d0482f63de">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="afeb0af1-5159-463d-893c-372eb713c31a">
    <name>КОплате</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="38b6b894-514c-40dc-9a4d-f114be9f1a16">
    <name>Оплачивается</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="06ccc02c-72ab-4b76-a0b3-695334fd7845">
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="010c24b1-693e-46e3-b142-cfd9d7165932">
    <name>Отгружается</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="c261318d-7813-4ff1-8601-69049a80e54a">
    <name>АналитикаУчетаПоПартнерам</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1baf9a7b-bf3d-4237-9957-6be8ef6deb04">
    <name>ОбъектРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="d320b33c-395d-45d0-a059-6ebb69d4403c">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

Trade.Partner_debt/src/InformationRegisters/АналитикаУчетаПоПартнерам/АналитикаУчетаПоПартнерам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="07f6396e-85dd-4872-b63a-5a338145a279">
  <name>АналитикаУчетаПоПартнерам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="bf73ad1b-dd32-4ae7-b5d4-bfbb2d5faf2c">
    <name>КлючАналитики</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="ce4afc20-8505-46d5-a85c-838839d5e4af">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="8405d6a4-a845-4ac6-ae27-40af6f5e486b">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="d4223e5c-d882-4a81-a66a-a517f5b369e6">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="86db4d02-cc95-45a8-8671-bdf0de9a5868">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="07e5f258-55a7-462f-b97f-88ffd8368fed">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Trade.Partner_debt/src/Enums/PartnerDebt_ТипУстановкиЛимитаДолга/PartnerDebt_ТипУстановкиЛимитаДолга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>PartnerDebt_ТипУстановкиЛимитаДолга</name>
  <enumValues>
    <name>МаксимальныйИзДоговора</name>
  </enumValues>
  <enumValues>
    <name>Ручной</name>
  </enumValues>
</mdclass:Enum>

Trade.Partner_debt/src/CommonModules/PartnerDebt_КонтрольДолгаПартнераВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

// Лимит долга партнера превышен.
// 
// Параметры:
//  ДокументСсылка - ДокументОбъект.РеализацияТоваровУслуг - РТУ
// 
// Возвращаемое значение:
//  Булево - Лимит долга партнера превышен
Функция ЛимитДолгаПартнераПревышен(ДокументСсылка) Экспорт
	
	ЛимитПривышен = Ложь;
	
	Лимит = ЛимитДолгаПартнера(ДокументСсылка.Партнер, ДокументСсылка.Дата);
	Если Лимит = 0 Тогда
		Возврат ЛимитПривышен;
	КонецЕсли;
	
	Долг = ДолгПартнераПоДокументу(ДокументСсылка);
	
	Если Долг > Лимит Тогда
		
		ЛимитПривышен = Истина;
		
		Текст = "Текущий сумарный долг по всем Контрагентм Партнера '" + Строка(ДокументСсылка.Партнер)
			+ "' составляет: " + Строка(Долг) + Символы.ПС + "Максимальный установленый лимит на "
			+ Строка(ДокументСсылка.Дата) + " составляет " + Строка(Лимит);
		
		ОбщегоНазначения.СообщитьПользователю(Текст);
		
	КонецЕсли;
	
	Возврат ЛимитПривышен;
	
КонецФункции

Процедура УстановитьНовыйЛимитДолга(Лимит, Партнер) Экспорт
	
	Набор = РегистрыСведений.PartnerDebt_РучныеЛимитыДолгаПартнера.СоздатьНаборЗаписей();
	Набор.Отбор.Партнер.Установить(Партнер);
	Набор.Прочитать();
	
	Запись = Набор.Добавить();
	Запись.Период = ТекущаяДатаСеанса();
	Запись.Партнер = Партнер;
	Запись.Сумма = Лимит;
	
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Долг партнера по документу.
// 
// Параметры:
//  ДокументСсылка - ДокументОбъект.РеализацияТоваровУслуг - РТУ
// 
// Возвращаемое значение:
//  Число - Долг партнера по документу
Функция ДолгПартнераПоДокументу(ДокументСсылка) Экспорт
	
	Долг = СуммаДолгаПартнера(ДокументСсылка.Партнер, ДокументСсылка.Организация, ДокументСсылка.Дата);
	
	Возврат Долг;
	
КонецФункции

// Лимит долга партнера.
// 
// Параметры:
//  Партнер - СправочникСсылка.Партнеры - Партнер
//  Дата - Дата - Дата на которую нужно получить лимит
//  ТипЛимита - ПеречислениеСсылка.PartnerDebt_ТипУстановкиЛимитаДолга - Тип лимита
// Возвращаемое значение:
//  Число - Лимит долга партнера
Функция ЛимитДолгаПартнера(Партнер, Дата = Неопределено, ТипЛимита = Неопределено) Экспорт
	
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ТипЛимита = Неопределено Тогда
		ТипЛимита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Партнер, "PartnerDebt_ТипУстановкиЛимитаДолга");
	КонецЕсли;
	
	Если ТипЛимита = Перечисления.PartnerDebt_ТипУстановкиЛимитаДолга.Ручной Тогда
		Лимит = РучнаяСуммаЛимитаПартнера(Партнер, Дата);
	Иначе
		Лимит = МаксимальнаяСуммаЛимитаПоДоговорамПартнера(Партнер, Дата);
	КонецЕсли;
	
	Возврат Лимит;
	
КонецФункции

// За основу функции взята Отчеты.ЗадолжностьКлиентов.Модульобхекта.ТекстЗапроса()
// И переделана, берутся все ключи партнера, и по ним собирается долг.
// 
// Параметры:
//  Партнер - СправочникСсылка.Партнеры - Партнер
//  Организация - СправочникСсылка.Организации - Организация
//  Дата - Дата - Дата
// 
// Возвращаемое значение:
//  Число - Долг в рублях
Функция СуммаДолгаПартнера(Партнер, Организация, Дата) Экспорт

	ДолгКлиента = 0;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("Дата", Дата);

	Запрос.Текст = ТекстЗапроса2();
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВалютаРубл = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Пока Выборка.Следующий() Цикл
		
		ДолгВВалюте = Выборка.ДолгКлиента;
		
		СуммаДолгаВРублях = РаботаСКурсамиВалют.ПересчитатьВВалюту(ДолгВВалюте, Выборка.Валюта,
			ВалютаРубл, Дата);
		
		ДолгКлиента = ДолгКлиента + СуммаДолгаВРублях;
		
	КонецЦикла;

	Возврат ДолгКлиента;

КонецФункции

// Имя элемента надписи долга.
// 
// Возвращаемое значение:
//  Строка - Имя элемента надписи долга
Функция ИмяЭлементаНадписиДолга() Экспорт
	Возврат "PartnerDebt_ТекущийЛимитДолга";
КонецФункции

// Наименование валюты управленческого учета.
// 
// Возвращаемое значение:
//  Строка - Наименование валюты управленческого учета
Функция НаименованиеВалютыУправленческогоУчета() Экспорт
	Возврат ЗначениеНастроекПовтИсп.БазоваяВалютаПоУмолчанию().Наименование;
КонецФункции

// Ручной тип установки лимита.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.PartnerDebt_ТипУстановкиЛимитаДолга - Ручной тип установки лимита
Функция РучнойТипУстановкиЛимита() Экспорт
	Возврат Перечисления.PartnerDebt_ТипУстановкиЛимитаДолга.Ручной;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИфункции

// Ручная сумма лимита партнера.
// 
// Параметры:
//  Партнер - СправочникСсылка.Партнеры - Партнер
//  Дата - Дата - Дата
// 
// Возвращаемое значение:
//  Число - Ручная сумма лимита партнера
Функция РучнаяСуммаЛимитаПартнера(Партнер, Дата)
	
	Лимит = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	PartnerDebt_РучныеЛимитыДолгаПартнераСрезПоследних.Сумма КАК Лимит
		|ИЗ
		|	РегистрСведений.PartnerDebt_РучныеЛимитыДолгаПартнера.СрезПоследних(&Дата, Партнер = &Партнер) КАК
		|		PartnerDebt_РучныеЛимитыДолгаПартнераСрезПоследних";
	
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Лимит = Выборка.Лимит;
	КонецЦикла;
	
	Возврат Лимит;
	
КонецФункции

// Максимальная сумма лимита по договорам партнера.
// 
// Параметры:
//  Партнер - СправочникСсылка.Партнеры - Партнер
//  Дата - Дата - Дата
// 
// Возвращаемое значение:
//  Число - Максимальная сумма лимита по договорам партнера
Функция МаксимальнаяСуммаЛимитаПоДоговорамПартнера(Партнер, Дата)
	
	Лимит = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.ДопустимаяСуммаЗадолженности КАК Лимит,
		|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Партнер = &Партнер
		|	И ДоговорыКонтрагентов.ПометкаУдаления = Ложь
		|	И ДоговорыКонтрагентов.Статус = &Статус";
	
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыДоговоровКонтрагентов.Действует);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ВалютаРубл = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Пока Выборка.Следующий() Цикл
		
		СуммаДолгаВРублях = РаботаСКурсамиВалют.ПересчитатьВВалюту(Выборка.Лимит, Выборка.ВалютаВзаиморасчетов,
			ВалютаРубл, Дата);
		
		// НУжно взять максимальную сумму из всех, сумма должна быть в рублях		
		Лимит = Макс(Лимит, СуммаДолгаВРублях);
		
	КонецЦикла;
	
	Возврат Лимит;
	
КонецФункции

Функция ТекстЗапроса()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
               |	КлючиАналитикиУчетаПоПартнерам.Ссылка КАК КлючиАналитики
               |ПОМЕСТИТЬ ВтКлючиАналитики
               |ИЗ
               |	Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
               |ГДЕ
               |	КлючиАналитикиУчетаПоПартнерам.Партнер = &Партнер
               |	И КлючиАналитикиУчетаПоПартнерам.Организация = &Организация
               |
               |ИНДЕКСИРОВАТЬ ПО
               |	КлючиАналитики
               |;
               |
               |////////////////////////////////////////////////////////////////////////////////
               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
               |	Расчеты.Организация КАК Организация,
               |	Расчеты.Партнер КАК Партнер,
               |	Расчеты.Валюта КАК Валюта,
               |	СУММА(Расчеты.НашДолг) КАК НашДолг,
               |	СУММА(Расчеты.ДолгКлиента) КАК ДолгКлиента
               |ПОМЕСТИТЬ ВтРасчеты
               |ИЗ
               |	(ВЫБРАТЬ
               |		&Организация КАК Организация,
               |		&Партнер КАК Партнер,
               |		РасчетыПоСрокам.Валюта КАК Валюта,
               |		РасчетыПоСрокам.ПредоплатаОстаток КАК НашДолг,
               |		РасчетыПоСрокам.ДолгОстаток КАК ДолгКлиента
               |	ИЗ
               |		РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
               |				&Дата,
               |				АналитикаУчетаПоПартнерам В
               |					(ВЫБРАТЬ
               |						ВтКлючиАналитики.КлючиАналитики
               |					ИЗ
               |						ВтКлючиАналитики КАК ВтКлючиАналитики)) КАК РасчетыПоСрокам) КАК Расчеты
               |
               |СГРУППИРОВАТЬ ПО
               |	Расчеты.Организация,
               |	Расчеты.Партнер,
               |	Расчеты.Валюта
               |;
               |
               |////////////////////////////////////////////////////////////////////////////////
               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
               |	Расчеты.Организация КАК Организация,
               |	Расчеты.Партнер КАК Партнер,
               |	Расчеты.Валюта КАК Валюта,
               |	Расчеты.ДолгКлиента КАК ДолгКлиента
               |ИЗ
               |	ВтРасчеты КАК Расчеты";
	
	Возврат ТекстЗапроса;
КонецФункции

Функция ТекстЗапроса2()
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	РасчетыСКлиентамиОстатки.СуммаОстаток + РасчетыСКлиентамиОстатки.ОтгружаетсяОстаток КАК ДолгКлиента,
	|	РасчетыСКлиентамиОстатки.Валюта КАК Валюта
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Остатки(&Дата
	|		,
	|		АналитикаУчетаПоПартнерам В (
	|			ВЫБРАТЬ
	|				АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики
	|			ИЗ
	|				РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|			ГДЕ
	|				АналитикаПоПартнерам.Партнер = &Партнер
    |				И АналитикаПоПартнерам.Организация = &Организация
	|			)
	|	) КАК РасчетыСКлиентамиОстатки
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти
